"""
Сервис хранения событий
-----------------------

Ваша задача написать сервис, который реализует API создания и завершения разных событий.
События могут быть разных типов. В базе данных может быть только одно незавершенное событие одного типа.

### Методы API

`POST /v1/start`

Тело запроса:

    {
        "type": "..."
    }

* `type` может содержать только строчные буквы латинского алфавита и цифры

Метод создает событие переданного типа. Если в базе уже есть незавершенное событие переданного типа,
то новое событие создавать не нужно, и в ответ не должно приходить сообщение об ошибке.

`POST /v1/finish`

Тело запроса:

    {
        "type": "..."
    }

Метод завершает событие переданного типа. Если незавершенного события такого типа в БД не найдено,
должна вернуться 404 ошибка.

### База данных

База данных должна быть MongoDB.
События всех типов должны хранится отдельными документами в одной коллекции.

Пример документа в коллекции:

    {
        "_id": "...",
        "type": "...",
        "state": 0, // state 0 - для незавершенных событий, 1 - для завершенных
        "started_at": "...", // Время начала события
        "finished_at": "...", // Время завершения события
    }

Если необходимо, документ может быть расширен.
"""

import uvicorn
from app import app

if __name__ == '__main__':
    uvicorn.run(app, host="0.0.0.0", port=8000, reload=True, debug="true")
